
cptypes = []

cptype = {
    "id":"1001",
    "name":"时时彩",
    "value":[
        {
            "id": "100101",
            "name": "五星",
            "value": [
                {
                    "id": "10010101",
                    "name": "五星直选",
                    "value": [
                        {
                            "id": "1001010101",
                            "name": "复式",
                            "rate": "98000",  # 赔率
                            "memo": {
                                "wfts": "从万千百十个位各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号相同，且顺序一致，即为中奖。",
                                "fl": "选号：88693，开奖号：88693。"
                            }
                        },
                        {
                            "id": "1001010102",
                            "name": "单式",
                            "rate": "98000",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个五位数号码组成一注。",
                                "zjsm": "输入号码与开奖号相同，且顺序一致，即为中奖。",
                                "fl": "选号：55664，开奖号：55664。"
                            }
                        },
                        {
                            "id": "1001010103",
                            "name": "组合",
                            "rate": "9.8 ~ 98000",  # 赔率
                            "memo": {
                                "wfts": "从万、千、百、十、个位中各选1个号码组成1-5星组合，共5注。",
                                "zjsm": "所选号的个位与开奖号个位相同，则中1个一星奖；所选号的十、个位与开奖号十、个位相同，则中1个一星奖和二星奖，以此类推，最高可中5个奖。如所选号个位不中奖，则余号均视为不中奖。",
                                "fl": "选号：23845，投注1元，由：23845（五星）、3845（四星）、845（三星）、45（二星）、5（一星）组成。开奖号：23865，则中1个一星奖，中奖金额为：赔率*本金*中奖注数；选号：23465，则中1个一星奖和二星奖，中奖金额为：（一星奖赔率+二星奖赔率）*本金；选号：23817，则不中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010102",
                    "name": "五星组选",
                    "value": [
                        {
                            "id": "1001010201",
                            "name": "组选120",
                            "rate": "816.666",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选5个号码组成一注。",
                                "zjsm": "不限顺序，开奖号中包含全部所选号，即为中奖。",
                                "fl": "选号：50719，开奖号：70915。"
                            }
                        },
                        {
                            "id": "1001010202",
                            "name": "组选60",
                            "rate": "1633.333",  # 赔率
                            "memo": {
                                "wfts": "选1个二重号，3个单号组成一注。",
                                "zjsm": "不限顺序，开奖号中包含全部所选号，且二重号出现2次，即为中奖。",
                                "fl": "二重号：8，单号：632，开奖号：82386。"
                            }
                        },
                        {
                            "id": "1001010203",
                            "name": "组选30",
                            "rate": "3266.666",  # 赔率
                            "memo": {
                                "wfts": "选2个二重号，1个单号组成一注。",
                                "zjsm": "不限顺序，开奖号中包含全部所选号，且2个二重号各出现2次，即为中奖。",
                                "fl": "二重号：8，4，单号：3，开奖号：43848。"
                            }
                        },
                        {
                            "id": "1001010204",
                            "name": "组选20",
                            "rate": "4900",  # 赔率
                            "memo": {
                                "wfts": "选1个三重号，2个单号组成一注。",
                                "zjsm": "不限顺序，开奖号中包含全部所选号，且三重号出现3次，即为中奖。",
                                "fl": "三重号：9，单号：2,3，开奖号：39929。"
                            }
                        },
                        {
                            "id": "1001010205",
                            "name": "组选10",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "从三重号和二重号中各选1个号码组成一注。",
                                "zjsm": "不限顺序，开奖号中所选的三重号出现3次，二重号出现2次，即为中奖。",
                                "fl": "三重号：8，二重号：3，开奖号：88383。"
                            }
                        },
                        {
                            "id": "1001010206",
                            "name": "组选5",
                            "rate": "19600",  # 赔率
                            "memo": {
                                "wfts": "选1个四重号，1个单号组成一注。",
                                "zjsm": "不限顺序，开奖号中包含全部所选号，且四重号出现4次，即为中奖。",
                                "fl": "四重号：6，单号：2，开奖号：62666。"
                            }
                        },
                    ],
                }
            ]
        },
        {
            "id": "100102",
            "name": "四星",
            "value": [
                {
                    "id": "10010201",
                    "name": "后四直选",
                    "value": [
                        {
                            "id": "1001020101",
                            "name": "复式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "从千、百、十、个位中各选1个号组成一注。",
                                "zjsm": "所选号与开奖号后四位号码相同，且顺序一致，即为中奖。",
                                "fl": "选号：8892，开奖号：*8892。"
                            }
                        },
                        {
                            "id": "1001020102",
                            "name": "单式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个四位数号码组成一注。",
                                "zjsm": "输入号与开奖号后四位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：4041，开奖号：*4041。"
                            }
                        },
                        {
                            "id": "1001020103",
                            "name": "组合",
                            "rate": "9.8 ~ 9800",  # 赔率
                            "memo": {
                                "wfts": "从千、百、十、个位中各选1个号码组成1-4星组合，共4注。",
                                "zjsm": "所选号的个位与开奖号个位相同，则中1个一星奖；所选号的十、个位与开奖号十、个位相同，则中1个一星奖和二星奖，以此类推，最高可中4个奖。如所选号个位不中奖，则余号均视为不中奖。",
                                "fl": "选号：3845，投注1元，由：3845（四星）、845（三星）、45（二星）、5（一星）组成。开奖号：3865，则中1个一星奖，中奖金额为：赔率*本金*中奖注数；选号：3465，则中1个一星奖和二星奖，中奖金额为：（一星奖赔率+二星奖赔率）*本金；选号：3817，则不中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010202",
                    "name": "后四组选",
                    "value": [
                        {
                            "id": "1001020201",
                            "name": "组选24",
                            "rate": "408.333",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选4个号码组成一注。",
                                "zjsm": "不限顺序，开奖号后四位中包含全部所选号，即为中奖。",
                                "fl": "选号：7631，开奖号：*3617。"
                            }
                        },
                        {
                            "id": "1001020202",
                            "name": "组选12",
                            "rate": "816.666",  # 赔率
                            "memo": {
                                "wfts": "选1个二重号，2个单号组成一注。",
                                "zjsm": "不限顺序，开奖号后四位中包含全部所选号，且二重号出现2次，即为中奖。",
                                "fl": "二重号：3，单号：7、5，开奖号：*3537，即为中奖。"
                            }
                        },
                        {
                            "id": "1001020203",
                            "name": "组选6",
                            "rate": "1633.333",  # 赔率
                            "memo": {
                                "wfts": "选2个二重号组成一注。",
                                "zjsm": "不限顺序，开奖号后四位中2个二重号各出现2次，即为中奖。",
                                "fl": "二重号：9、7，开奖号：*7997。"
                            }
                        },
                        {
                            "id": "1001020204",
                            "name": "组选4",
                            "rate": "2450",  # 赔率
                            "memo": {
                                "wfts": "选1个三重号，1个单号组成一注。",
                                "zjsm": "不限顺序，开奖号后四位中包含全部所选号，且三重号出现3次，即为中奖。",
                                "fl": "三重号：5，单号：2，开奖号：*5525。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010203",
                    "name": "前四直选",
                    "value": [
                        {
                            "id": "1001020301",
                            "name": "复式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "从万、千、百、十位中各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号前四位相同，且顺序一致，即为中奖。",
                                "fl": "所选号：6697，开奖号：6697*。"
                            }
                        },
                        {
                            "id": "1001020302",
                            "name": "单式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个四位数号码组成一注。",
                                "zjsm": "所选号与开奖号前四位相同，且顺序一致，即为中奖。",
                                "fl": "输入号：6697，开奖号：6697*。"
                            }
                        },
                        {
                            "id": "1001020303",
                            "name": "组合",
                            "rate": "9.8 ~ 9800",  # 赔率
                            "memo": {
                                "wfts": "从万、千、百、十位中各选1个号码组成1-4星组合，共4注。",
                                "zjsm": "所选号的十位与开奖号十位相同，则中1个一星奖；所选号的百、十位与开奖号百、十位相同，则中1个一星奖和二星奖，以此类推，最高可中4个奖。如所选号十位不中奖，则余号均视为不中奖。",
                                "fl": "选号：3845，投注1元，由：3845（四星）、845（三星）、45（二星）、5（一星）组成。开奖号：3865，则中1个一星奖，中奖金额为：赔率*本金*中奖注数；选号：3465，则中1个一星奖和二星奖，中奖金额为：（一星奖赔率+二星奖赔率）*本金；选号：3817，则不中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010204",
                    "name": "前四组选",
                    "value": [
                        {
                            "id": "1001020401",
                            "name": "组选24",
                            "rate": "408.333",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选4个号码组成一注。",
                                "zjsm": "不限顺序，开奖号前四位中包含全部所选号，即为中奖。",
                                "fl": "所选号：5231，开奖号：3152*。"
                            }
                        },
                        {
                            "id": "1001020402",
                            "name": "组选12",
                            "rate": "816.666",  # 赔率
                            "memo": {
                                "wfts": "选1个二重号，2个单号组成一注。",
                                "zjsm": "不限顺序，开奖号前四位中包含全部所选号，且二重号出现2次，即为中奖。",
                                "fl": "二重号：8，单号：2、4，开奖号：8428*。"
                            }
                        },
                        {
                            "id": "1001020403",
                            "name": "组选6",
                            "rate": "1633.333",  # 赔率
                            "memo": {
                                "wfts": "选2个二重号组成一注。",
                                "zjsm": "不限顺序，开奖号前四位中2个二重号各出现2次，即为中奖。",
                                "fl": "二重号：6、8；开奖号：6868*。"
                            }
                        },
                        {
                            "id": "1001020404",
                            "name": "组选4",
                            "rate": "2450",  # 赔率
                            "memo": {
                                "wfts": "选1个三重号，1个单号组成一注。",
                                "zjsm": "不限顺序，开奖号前四位中包含全部所选号，且三重号出现3次，即为中奖。",
                                "fl": "三重号：1，单号：3，开奖号：3111*。"
                            }
                        },
                    ],
                }
            ]
        },
        {
            "id": "100103",
            "name": "三星",
            "value": [
                {
                    "id": "10010301",
                    "name": "后三直选",
                    "value": [
                        {
                            "id": "1001030101",
                            "name": "复式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从百、十、个位中各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号后三位相同，且顺序一致，即为中奖。",
                                "fl": "所选号：265，开奖号：**265。"
                            }
                        },
                        {
                            "id": "1001030102",
                            "name": "单式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码组成一注。",
                                "zjsm": "输入号与开奖号后三位相同，且顺序一致，即为中奖。",
                                "fl": "输入号：265，开奖号：**265。"
                            }
                        },
                        {
                            "id": "1001030103",
                            "name": "直选和值",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-27中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号后三位数相加之和，即为中奖。",
                                "fl": "所选号：3，开奖号：**102。"
                            }
                        },
                        {
                            "id": "1001030104",
                            "name": "直选跨度",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号后三位的最大最小数字差值，即为中奖。",
                                "fl": "选号：5，开奖号：80469（后三位：最大9-最小4=5），即为中奖。"
                            }
                        },
                        {
                            "id": "1001030105",
                            "name": "和值尾数",
                            "rate": "9.9",  # 赔率
                            "memo": {
                                "wfts": "对开奖号后三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。",
                                "zjsm": "开奖号后三位号码相加之和的尾数与所选号相同，即为中奖。",
                                "fl": "选号：4，开奖号：**356，和值14尾数为4，故中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010302",
                    "name": "后三组选",
                    "value": [
                        {
                            "id": "1001030201",
                            "name": "组三",
                            "rate": "326.666",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码组成两注。",
                                "zjsm": "不限顺序，开奖号后三位中包含全部所选号，且其中一个所选号出现2次，即为中奖。",
                                "fl": "选号：6、2，开奖号：**626、**226，均为中奖。"
                            }
                        },
                        {
                            "id": "1001030202",
                            "name": "组六",
                            "rate": "163.333",  # 赔率
                            "memo": {
                                "wfts": "任选3个不同的号码组成一注。",
                                "zjsm": "不限顺序，开奖号后三位中包含全部所选号，即为中奖。",
                                "fl": "所选号：9、1、5，开奖号：**591，即为中奖。"
                            }
                        },
                        {
                            "id": "1001030203",
                            "name": "混合组选",
                            "rate": "163.333 ~ 326.666",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码（不含豹子号）组成一注。",
                                "zjsm": "其中1个所选号在开奖号后三位中出现2次，则中组三奖；开奖号后三位中包含全部所选号，且无重复号码出现，则中组六奖。",
                                "fl": "输入号：889，开奖号：**898，中组三奖；输入号：725，开奖号：**527，中组六奖。"
                            }
                        },
                        {
                            "id": "1001030204",
                            "name": "组选包胆",
                            "rate": "163.999 ~ 330",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个包胆号码为一注。",
                                "zjsm": "不限顺序，开奖号后三位中包含所选的包胆号（不含豹子号），即为中奖。",
                                "fl": "选号：3，开奖号：**356或**353，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010303",
                    "name": "中三直选",
                    "value": [
                        {
                            "id": "1001030301",
                            "name": "复式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从千、百、十位中各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。",
                                "fl": "所选号：456，开奖号：*456*。"
                            }
                        },
                        {
                            "id": "1001030302",
                            "name": "单式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码组成一注。",
                                "zjsm": "所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：456，开奖号：*456*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001030303",
                            "name": "直选和值",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-27中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号中间三位数相加之和，即为中奖。",
                                "fl": "所选号：9，开奖号：*153*（1+5+3=9）。"
                            }
                        },
                        {
                            "id": "1001030304",
                            "name": "直选跨度",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号中间三位的最大最小数字差值，即为中奖。",
                                "fl": "选号：5，开奖号：89641（中间三位：最大9-最小4=5），即为中奖。"
                            }
                        },
                        {
                            "id": "1001030305",
                            "name": "和值尾数",
                            "rate": "9.9",  # 赔率
                            "memo": {
                                "wfts": "对开奖号中间三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。",
                                "zjsm": "开奖号中间三位号码相加之和的尾数与所选号相同，即为中奖。",
                                "fl": "选号：9，开奖号：*856*，和值19尾数为9，故中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010304",
                    "name": "中三组选",
                    "value": [
                        {
                            "id": "1001030401",
                            "name": "组三",
                            "rate": "326.666",  # 赔率
                            "memo": {
                                "wfts": "任选2个号码组成两注。",
                                "zjsm": "开奖号中间三位中包含全部所选号，且其中一个号码出现2次，即为中奖。",
                                "fl": "选号：1、6，开奖号：*166*、*161*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001030402",
                            "name": "组六",
                            "rate": "163.333",  # 赔率
                            "memo": {
                                "wfts": "任选3个不同的号码组成一注。",
                                "zjsm": "开奖号中间三位中包含全部所选号，即为中奖。",
                                "fl": "选号：2、5、3，开奖号：*325*。"
                            }
                        },
                        {
                            "id": "1001030403",
                            "name": "混合组选",
                            "rate": "163.333 ~ 326.666",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码（不含豹子号）组成一注。",
                                "zjsm": "其中1个所选号在开奖号中间三位里出现2次，则中组三奖；开奖号中间三位中包含全部所选号，且无重复号码出现，则中组六奖。",
                                "fl": "输入号：889，开奖号：*898*，则中组三奖；输入号：725，开奖号：*527*，则中组六奖。"
                            }
                        },
                        {
                            "id": "1001030404",
                            "name": "组选包胆",
                            "rate": "164.999 ~ 330",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个包胆号码为一注。",
                                "zjsm": "不限顺序，开奖号中间三位中包含所选的包胆号（不含豹子号），即为中奖。",
                                "fl": "选号：8，开奖号：*856*或 *883*，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010305",
                    "name": "前三直选",
                    "value": [
                        {
                            "id": "1001030501",
                            "name": "复式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从万、千、百位各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号前三位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：729**，开奖号：729**。"
                            }
                        },
                        {
                            "id": "1001030502",
                            "name": "单式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码组成一注。",
                                "zjsm": "输入号与开奖号前三位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：729**，开奖号：729**。"
                            }
                        },
                        {
                            "id": "1001030503",
                            "name": "直选和值",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-27中任选1个号码组成一注。",
                                "zjsm": "从0-27中任选1个号码组成一注。",
                                "fl": "选号：7，开奖号：124**（1+2+4=7）。"
                            }
                        },
                        {
                            "id": "1001030504",
                            "name": "直选跨度",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号前三位的最大最小数字差值，即为中奖。",
                                "fl": "选号：5，开奖号：94674（前三位：最大9-最小4=5），即为中奖。"
                            }
                        },
                        {
                            "id": "1001030505",
                            "name": "和值尾数",
                            "rate": "9.9",  # 赔率
                            "memo": {
                                "wfts": "对开奖号前三位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。",
                                "zjsm": "开奖号前三位号码相加之和的尾数与所选号相同，即为中奖。",
                                "fl": "选号：8，开奖号：981**，和值18尾数为8，故中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010306",
                    "name": "前三组选",
                    "value": [
                        {
                            "id": "1001030601",
                            "name": "组三",
                            "rate": "326.666",  # 赔率
                            "memo": {
                                "wfts": "任选2个号码组成两注。",
                                "zjsm": "不限顺序，开奖号前三位中包含全部所选号，且其中一个号码出现2次，即为中奖。中奖。",
                                "fl": "选号：5、9，开奖号：559**、995**，均为中奖。"
                            }
                        },
                        {
                            "id": "1001030602",
                            "name": "组六",
                            "rate": "163.333",  # 赔率
                            "memo": {
                                "wfts": "任选3个不同的号码组成一注。",
                                "zjsm": "不限顺序，开奖号前三位中包含全部所选号，即为中奖。",
                                "fl": "选号：2、9、4，开奖号：942**。"
                            }
                        },
                        {
                            "id": "1001030603",
                            "name": "混合组选",
                            "rate": "163.333 ~ 326.666",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个三位数号码（不含豹子号）组成一注。",
                                "zjsm": "其中1个输入号在开奖号前三位中出现2次，则中组三奖；开奖号前三位中包含全部输入号，且无重复号码出现，则中组六奖。",
                                "fl": "输入号：889，开奖号：898**，则中组三奖；输入号：725，开奖号：527**，则中组六奖。"
                            }
                        },
                        {
                            "id": "1001030604",
                            "name": "组选包胆",
                            "rate": "164.999 ~ 330",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个包胆号码为一注。",
                                "zjsm": "不限顺序，开奖号前三位中包含所选的包胆号（不含豹子号），即为中奖。",
                                "fl": "选号：6，开奖号：986**或 668**，均为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100104",
            "name": "二星",
            "value": [
                {
                    "id": "10010401",
                    "name": "后二直选",
                    "value": [
                        {
                            "id": "1001040101",
                            "name": "复式",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从十、个位中各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号后二位号码相同，且顺序一致，即为中奖。",
                                "fl": "选号：5、2，开奖号：***52。"
                            }
                        },
                        {
                            "id": "1001040102",
                            "name": "单式",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个两位数号码组成一注。",
                                "zjsm": "输入号与开奖号后两位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：5、2，开奖号：***52。"
                            }
                        },
                        {
                            "id": "1001040103",
                            "name": "直选和值",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从0-18中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号后两位数相加之和，即为中奖。",
                                "fl": "所选号：6，开奖号：***24（2+4=6）。"
                            }
                        },
                        {
                            "id": "1001040104",
                            "name": "直选跨度",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号后两位的最大最小数字差值，即为中奖。",
                                "fl": "选号：5，开奖号：94694（后二位：最大9-最小4=5），即为中奖。"
                            }
                        },
                        {
                            "id": "1001040105",
                            "name": "和值尾数",
                            "rate": "9.9",  # 赔率
                            "memo": {
                                "wfts": "对开奖号后两位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。",
                                "zjsm": "开奖号后两位号码相加之和的尾数与所选号相同，即为中奖。",
                                "fl": "选号：7，开奖号：***98，和值17尾数为7，故中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010402",
                    "name": "后二组选",
                    "value": [
                        {
                            "id": "1001040201",
                            "name": "复式",
                            "rate": "49",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码组成一注。",
                                "zjsm": "不限顺序，开奖号后两位数中包含所选号，即为中奖。",
                                "fl": "所选号：5、6，开奖号：***65。"
                            }
                        },
                        {
                            "id": "1001040202",
                            "name": "单式",
                            "rate": "49",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个两位数号码组成一注。",
                                "zjsm": "不限顺序，开奖号后两位数中包含所选号即为中奖。",
                                "fl": "输入号：5、6，开奖号：***65。"
                            }
                        },
                        {
                            "id": "1001040203",
                            "name": "单选包胆",
                            "rate": "49.5",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个包胆号码为一注。",
                                "zjsm": "不限顺序，开奖号后两位中包含所选的包胆号（不含对子号），即为中奖。",
                                "fl": "选号：3，开奖号：***35或 ***03，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010403",
                    "name": "前二直选",
                    "value": [
                        {
                            "id": "1001040301",
                            "name": "复式",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从万、千位中各选1个号码组成一注。",
                                "zjsm": "所选号与开奖号前两位号码相同，且顺序一致，即为中奖。",
                                "fl": "所选号：5、6，开奖号：56***。"
                            }
                        },
                        {
                            "id": "1001040302",
                            "name": "单选",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个两位数号码组成一注。",
                                "zjsm": "输入号与开奖号前两位号码相同，且顺序一致，即为中奖。",
                                "fl": "输入号：5、6，开奖号：56***。"
                            }
                        },
                        {
                            "id": "1001040303",
                            "name": "直选和值",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从0-18中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号前两位数相加之和，即为中奖。",
                                "fl": "所选号：6，开奖号：24***（2+4=6）。"
                            }
                        },
                        {
                            "id": "1001040304",
                            "name": "直选跨度",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "所选号数值等于开奖号前两位的最大最小数字差值，即为中奖。",
                                "fl": "选号：5，开奖号：94674（前二位：最大9-最小4=5），即为中奖。"
                            }
                        },
                        {
                            "id": "1001040305",
                            "name": "和值尾数",
                            "rate": "9.9",  # 赔率
                            "memo": {
                                "wfts": "对开奖号前两位号码相加之和的尾数进行投注，从0-9中任选1个号码为一注。",
                                "zjsm": "开奖号前两位号码相加之和的尾数与所选号相同，即为中奖。",
                                "fl": "选号：7，开奖号：98***，和值17尾数为7，故中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010404",
                    "name": "前二组选",
                    "value": [
                        {
                            "id": "1001040401",
                            "name": "复式",
                            "rate": "49",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码组成一注。",
                                "zjsm": "不限顺序，开奖号前两位数中包含所选号，即为中奖。",
                                "fl": "所选号：8、9，开奖号：98***。"
                            }
                        },
                        {
                            "id": "1001040402",
                            "name": "单式",
                            "rate": "49",  # 赔率
                            "memo": {
                                "wfts": "手动输入1个两位数号码组成一注。",
                                "zjsm": "不限顺序，开奖号前两位数中包含全部输入号，即为中奖。",
                                "fl": "输入号：8、9，开奖号：98***。"
                            }
                        },
                        {
                            "id": "1001040403",
                            "name": "组选包胆",
                            "rate": "49.5",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个包胆号码为一注。",
                                "zjsm": "不限顺序，开奖号前两位中包含所选的包胆号（不含对子号），即为中奖。",
                                "fl": "选号：8，开奖号：***89或 ***68，均为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100105",
            "name": "定位胆",
            "value": [
                {
                    "id": "10010501",
                    "name": "定位胆",
                    "value": [
                        {
                            "id": "1001050101",
                            "name": "定位胆",
                            "rate": "9.8",  # 赔率
                            "memo": {
                                "wfts": "任选1个位置并选1个号码组成一注。",
                                "zjsm": "所选号与相同位置上的开奖号一致，即为中奖。",
                                "fl": "选位：百位，选号：5，开奖号：**5**。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100106",
            "name": "不定位",
            "value": [
                {
                    "id": "10010601",
                    "name": "三星不定位",
                    "value": [
                        {
                            "id": "1001060101",
                            "name": "后三一码",
                            "rate": "3.616",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号后三位号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：**523、**253、**325，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060102",
                            "name": "中三一码",
                            "rate": "3.616",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号中间三位号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：*523*、*253*、*325*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060103",
                            "name": "前三一码",
                            "rate": "3.616",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号前三位号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：523**、253**、325**，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060104",
                            "name": "后三二码",
                            "rate": "18.148",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号后三位号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：**523、**253、**325，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060105",
                            "name": "中三二码",
                            "rate": "18.148",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号中间三位号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：*523*、*253*、*325*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060106",
                            "name": "前三二码",
                            "rate": "18.148",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号前三位号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：5 2 3 * *、2 5 3 * *、3 2 5 * *，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010602",
                    "name": "四星不定位",
                    "value": [
                        {
                            "id": "1001060201",
                            "name": "前四一码",
                            "rate": "2.871",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号前四位号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：5231*、2531*、3251*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060202",
                            "name": "后四一码",
                            "rate": "2.871",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号后四位号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：*5231、*2531、*3251，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060203",
                            "name": "前四二码",
                            "rate": "10.157",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号前四位号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：5231*、2531*、3251*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060204",
                            "name": "后四二码",
                            "rate": "10.157",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号后四位号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：*5231、*2531、*3251，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060205",
                            "name": "前四三码",
                            "rate": "48.52",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选3个号码为一注。",
                                "zjsm": "不限顺序，开奖号前四位号码中包含所选的3个号码，即为中奖。",
                                "fl": "选号：5、2、3，开奖号：5231*、2531*、3251*，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060206",
                            "name": "后四三码",
                            "rate": "48.52",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选3个号码为一注。",
                                "zjsm": "不限顺序，开奖号后四位号码中包含所选的3个号码，即为中奖。",
                                "fl": "选号：5、2、3，开奖号：*5231、*2531、*3251，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010603",
                    "name": "五星不定位",
                    "value": [
                        {
                            "id": "1001060301",
                            "name": "五星一码",
                            "rate": "2.416",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码为一注。",
                                "zjsm": "不限顺序，开奖号5个号码中包含所选号，即为中奖。",
                                "fl": "选号：5，开奖号：52431、35241、34521、13452、23415 ，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060302",
                            "name": "五星二码",
                            "rate": "6.742",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选2个号码为一注。",
                                "zjsm": "不限顺序，开奖号5个号码中包含所选的2个号码，即为中奖。",
                                "fl": "选号：5、2，开奖号：52431、35241、34521、13452、23415 ，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060303",
                            "name": "五星三码",
                            "rate": "22.75",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选3个号码为一注。",
                                "zjsm": "不限顺序，开奖号5个号码中包含所选的3个号码，即为中奖。",
                                "fl": "选号：5、2、1，开奖号：52134、45213、34521、13 452，均为中奖。"
                            }
                        },
                        {
                            "id": "1001060304",
                            "name": "五星四码",
                            "rate": "103.118",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选4个号码为一注。",
                                "zjsm": "不限顺序，开奖号5个号码中包含所选的4个号码，即为中奖。",
                                "fl": "选号：5、2、1、3，开奖号：52134、45213、34521、13452，均为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100107",
            "name": "任选",
            "value": [
                {
                    "id": "10010701",
                    "name": "任二",
                    "value": [
                        {
                            "id": "1001070101",
                            "name": "复式",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "任选2个位置并各选1个号码组成一注。",
                                "zjsm": "所选2个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。",
                                "fl": "万位：5，十位：6，开奖号：5**6*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001070102",
                            "name": "单式",
                            "rate": "98",  # 赔率
                            "memo": {
                                "wfts": "手动勾选任意2个位置，并输入1个两位数号码组成一注。",
                                "zjsm": "所选2个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。",
                                "fl": "万位：5，十位：6，开奖号：5**6*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001070103",
                            "name": "组选",
                            "rate": "49",  # 赔率
                            "memo": {
                                "wfts": "任选2个位置并各选1个号码组成一注。",
                                "zjsm": "不限顺序，所选2个位置上的开奖号中包含全部所选号，即为中奖。",
                                "fl": "万位：5，十位：6，开奖号：5**6*、6**5*，均为中奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010702",
                    "name": "任三",
                    "value": [
                        {
                            "id": "1001070201",
                            "name": "复式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "任选3个位置并各选1个号码组成一注。",
                                "zjsm": "所选3个位置上的开奖号与所选号相同，且顺序一致，即为中奖。",
                                "fl": "万位：5，百位：1，十位：6，开奖号：5*16*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001070202",
                            "name": "单式",
                            "rate": "980",  # 赔率
                            "memo": {
                                "wfts": "手动勾选任意3个位置，并输入1个三位数号码组成一注。",
                                "zjsm": "所选3个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。",
                                "fl": "万位：5，百位：1，十位：6，开奖号：5*16*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001070203",
                            "name": "组三",
                            "rate": "326.666",  # 赔率
                            "memo": {
                                "wfts": "手动勾选任意3个位置，并从0-9中任选2个号码组成两注。",
                                "zjsm": "不限顺序，所选3个位置上的开奖号中包含全部所选号，且其中一个号码出现两次，即为中奖。",
                                "fl": "选位：千、百、个，选号：7、5，开奖号：*77*5、*57*5，均为中奖。"
                            }
                        },
                        {
                            "id": "1001070204",
                            "name": "组六",
                            "rate": "163.333",  # 赔率
                            "memo": {
                                "wfts": "手动勾选任意3个位置，并从0-9中任选3个不同的号码组成一注。",
                                "zjsm": "不限顺序，所选3个位置上的开奖号中包含全部所选号，即为中奖。",
                                "fl": "选位：千、百、个，选号：7、5、2，开奖号：*72*5、*52*7，均为中奖。"
                            }
                        },
                        {
                            "id": "1001070205",
                            "name": "混合组选",
                            "rate": "163.333 ~ 326.666",  # 赔率
                            "memo": {
                                "wfts": "勾选任意3个位置，并手动输入1个三位数号码（不含豹子号）组成一注。",
                                "zjsm": "不限顺序，所选3个位置上的开奖号中包含全部输入号，且其中一个号码出现2次，则中组三奖；不限顺序，所选3个位置上的开奖号与全部输入号相同，则中组六奖。",
                                "fl": "选位：千、百、个，输入号：*88*9，开奖号：*89*8，中组三奖。输入号：725，开奖号：*52*7，中组六奖。"
                            }
                        },
                    ],
                },
                {
                    "id": "10010703",
                    "name": "任四",
                    "value": [
                        {
                            "id": "1001070301",
                            "name": "复式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "任选4个位置并各选1个号码组成一注。",
                                "zjsm": "所选4个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。",
                                "fl": "选位：万位：2，千位：8，十位：4，个位：9，开奖号：28*49，即为中奖。"
                            }
                        },
                        {
                            "id": "1001070302",
                            "name": "单式",
                            "rate": "9800",  # 赔率
                            "memo": {
                                "wfts": "手动勾选4个位置，并输入1位四位数号码组成一注。",
                                "zjsm": "所选4个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。",
                                "fl": "选位：万位：2，千位：8，十位：4，个位：9，开奖号：28*49，即为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100108",
            "name": "趣味",
            "value": [
                {
                    "id": "10010801",
                    "name": "特殊",
                    "value": [
                        {
                            "id": "1001080101",
                            "name": "一帆风顺",
                            "rate": "2.393",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个号码组成一注。",
                                "zjsm": "不限顺序，开奖号中包含所选号，即为中奖。",
                                "fl": "选号：8，开奖号：***8*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001080102",
                            "name": "好事成双",
                            "rate": "12.032",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个二重号组成一注。",
                                "zjsm": "所选号在开奖号中出现2次，即为中奖。",
                                "fl": "二重号：8，开奖号：*8*8*，即为中奖。"
                            }
                        },
                        {
                            "id": "1001080103",
                            "name": "三星报喜",
                            "rate": "114.487",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个三重号组成一注。",
                                "zjsm": "所选号在开奖号中出现3次，即为中奖。",
                                "fl": "三重号：8，开奖号：*8*88，即为中奖。"
                            }
                        },
                        {
                            "id": "1001080104",
                            "name": "四季发财",
                            "rate": "2130.435",  # 赔率
                            "memo": {
                                "wfts": "从0-9中任选1个四重号组成一注。",
                                "zjsm": "所选号在开奖号中出现4次，即为中奖。",
                                "fl": "四重号：8，开奖号：*8888，即为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100109",
            "name": "龙虎",
            "value": [
                {
                    "id": "10010901",
                    "name": "龙虎",
                    "value": [
                        {
                            "id": "1001090101",
                            "name": "万千",
                            "rate": [
                                {
                                    "id":"1",
                                    "name":"龙",
                                    "value":"2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据万、千位数值比大小，万位号大于千位号为龙，小于则为虎，相同则为和；所选形态与开奖号形态一致。",
                                "fl": "投注：龙，开奖号：82635（万位：8大于千位2），即为中奖。"
                            }
                        },
                        {
                            "id": "1001090102",
                            "name": "万百",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据万、百位数值比大小，万位号码大于百位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：82635（万位：8大于百位6），即为中奖。"
                            }
                        },
                        {
                            "id": "1001090103",
                            "name": "万十",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据万、十位数值比大小，万位号码大于十位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：82635,（万位：8大于十位3）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090104",
                            "name": "万个",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据万、个位数值比大小，万位号码大于个位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：82635,（万位：8大于个位5）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090105",
                            "name": "千百",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据千、百位数值比大小，千位号码大于百位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：28635,（千位：8大于百位6）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090106",
                            "name": "千十",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据千、十位数值比大小，千位号码大于十位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：28635,（千位：8大于十位3）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090107",
                            "name": "千个",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据千、个位数值比大小，千位号码大于个位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：28635,（千位：8大于个位5）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090108",
                            "name": "百十",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据百、十位数值比大小，百位号码大于十位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：26835,（百位：8大于十位3）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090109",
                            "name": "百个",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据百、个位数值比大小，百位号码大于个位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：26835,（百位：8大于个位5）即为中奖。"
                            }
                        },
                        {
                            "id": "1001090110",
                            "name": "十个",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "龙",
                                    "value": "2.179"
                                },
                                {
                                    "id": "2",
                                    "name": "虎",
                                    "value": "2.179"
                                },
                                {
                                    "id": "3",
                                    "name": "和",
                                    "value": "9.8"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "任选1个形态组成一注。",
                                "zjsm": "根据十、个位数值比大小，十位号码大于个位号码为龙，小于则为虎，相同则为和；所选形态与开奖号码形态一致。",
                                "fl": "投注：龙，开奖号：26185,（十位：8大于个位5）即为中奖。"
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100110",
            "name": "特殊号",
            "value": [
                {
                    "id": "10011001",
                    "name": "特殊号",
                    "value": [
                        {
                            "id": "1001100101",
                            "name": "前三",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "豹子",
                                    "value": "99"
                                },
                                {
                                    "id": "2",
                                    "name": "顺子",
                                    "value": "16.434"
                                },
                                {
                                    "id": "3",
                                    "name": "对子",
                                    "value": "3.663"
                                },
                                {
                                    "id": "4",
                                    "name": "半顺",
                                    "value": "2.742"
                                },
                                {
                                    "id": "5",
                                    "name": "杂六",
                                    "value": "3.297"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "对开奖号前三位的号码形态进行投注，任选1个形态组成一注。",
                                "zjsm": "不限顺序，开奖号前三位的号码形态与所选形态相同，即为中奖。",
                                "fl": """
                                豹子：中奖号码的百位千位万位数字都相同。\n
                                顺子：中奖号码的百位千位万位数字都相连，不分顺序。\n
                                对子：中奖号码的百位千位万位任意两位数字相同。\n
                                半顺：中奖号码的百位千位万位任意两位数字相连，不分顺序。（不包括顺子、对子。）\n
                                杂六：不包括豹子、对子、顺子、半顺的所有中奖号码。\n
                                """
                            }
                        },
                        {
                            "id": "1001100102",
                            "name": "中三",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "豹子",
                                    "value": "99"
                                },
                                {
                                    "id": "2",
                                    "name": "顺子",
                                    "value": "16.434"
                                },
                                {
                                    "id": "3",
                                    "name": "对子",
                                    "value": "3.663"
                                },
                                {
                                    "id": "4",
                                    "name": "半顺",
                                    "value": "2.742"
                                },
                                {
                                    "id": "5",
                                    "name": "杂六",
                                    "value": "3.297"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "对开奖号中间三位号码的形态进行投注，任选1个形态组成一注。",
                                "zjsm": "不限顺序，开奖号中间三位的号码形态与所选形态相同，即为中奖。",
                                "fl": """
                                    豹子：中奖号码的十位百位千位数字都相同。\n
                                    顺子：中奖号码的十位百位千位数字都相连，不分顺序。\n
                                    对子：中奖号码的十位百位千位任意两位数字相同。\n
                                    半顺：中奖号码的十位百位千位任意两位数字相连，不分顺序。（不包括顺子、对子。）\n
                                    杂六：不包括豹子、对子、顺子、半顺的所有中奖号码。\n
                                """
                            }
                        },
                        {
                            "id": "1001100103",
                            "name": "后三",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "豹子",
                                    "value": "99"
                                },
                                {
                                    "id": "2",
                                    "name": "顺子",
                                    "value": "16.434"
                                },
                                {
                                    "id": "3",
                                    "name": "对子",
                                    "value": "3.663"
                                },
                                {
                                    "id": "4",
                                    "name": "半顺",
                                    "value": "2.742"
                                },
                                {
                                    "id": "5",
                                    "name": "杂六",
                                    "value": "3.297"
                                }
                            ],  # 赔率
                            "memo": {
                                "wfts": "对开奖号后三位号码的形态进行投注，任选1个形态组成一注。",
                                "zjsm": "不限顺序，开奖号后三位的号码形态与所选形态相同，即为中奖。",
                                "fl": """
                                        豹子：中奖号码的个位十位百位数字都相同。\n
                                        顺子：中奖号码的个位十位百位数字都相连，不分顺序。\n
                                        对子：中奖号码的个位十位百位任意两位数字相同。\n
                                        半顺：中奖号码的个位十位百位任意两位数字相连，不分顺序。（不包括顺子、对子。）\n
                                        杂六：不包括豹子、对子、顺子、半顺的所有中奖号码。\n
                                    """
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100111",
            "name": "斗牛",
            "value": [
                {
                    "id": "10011101",
                    "name": "斗牛",
                    "value": [
                        {
                            "id": "1001110101",
                            "name": "斗牛",
                            "rate": [
                                {
                                    "id": "1",
                                    "name": "牛牛",
                                    "value": "10.672"
                                },
                                {
                                    "id": "2",
                                    "name": "牛九",
                                    "value": "10.672"
                                },
                                {
                                    "id": "3",
                                    "name": "牛八",
                                    "value": "10.672"
                                },
                                {
                                    "id": "4",
                                    "name": "牛七",
                                    "value": "10.672"
                                },
                                {
                                    "id": "5",
                                    "name": "牛六",
                                    "value": "10.672"
                                },
                                {
                                    "id": "6",
                                    "name": "牛五",
                                    "value": "10.672"
                                },
                                {
                                    "id": "7",
                                    "name": "牛四",
                                    "value": "10.672"
                                },
                                {
                                    "id": "8",
                                    "name": "牛三",
                                    "value": "10.672"
                                },
                                {
                                    "id": "9",
                                    "name": "牛二",
                                    "value": "10.672"
                                },
                                {
                                    "id": "10",
                                    "name": "牛一",
                                    "value": "10.672"
                                },
                                {
                                    "id": "11",
                                    "name": "无牛",
                                    "value": "2.138"
                                },
                            ],  # 赔率
                            "memo": {
                                "wfts": "从牛牛、无牛、牛一~牛九中任选1个为一注。",
                                "zjsm": "开奖号码任意3个号码相加的和为10的倍数（0为10）即为有牛，否则为无牛，剩余2个号码的和值数即为牛几。所选形态与开奖形态相同，即为中奖。",
                                "fl": """选号：牛牛，开奖号：56937,任意3个号码的和值为10的倍数，后剩余2个号码的和值为10的倍数（0看做10），故中奖。选号：无牛，开奖号：22381, 开奖号任意3个号码相加无法组成10的倍数，即无牛，故中奖。选号：牛八，开奖号：99253，任意3个号码（2+3+5或9+9+2）和值为10的整数，任意2个号码（9+9或5+3）相加为8，故中奖。"""
                            }
                        },
                    ],
                },
            ]
        },
        {
            "id": "100112",
            "name": "大小单双",
            "value": [
                {
                    "id": "10011201",
                    "name": "总和",
                    "value": [
                        {
                            "id": "1001120101",
                            "name": "总和",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对5个开奖号相加之和的大（23~45）、小（0~22）、单（总和值为单）、双（总和值为双）进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号5个号码相加之和相同，即为中奖。",
                                "fl": """选号：小、双，开奖号：73510，总和值16在小0~22的范围内，且为双数，故中奖。"""
                            }
                        },
                    ],
                },
                {
                    "id": "10011202",
                    "name": "定位",
                    "value": [
                        {
                            "id": "1001120201",
                            "name": "万位",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对开奖号的万位进行大（5~9）小（0~4）、单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号的万位号码形态相同，即为中奖。",
                                "fl": """选号：大、单，开奖号：52901，万位号码5在大5~9的范围内，且为单数，故中奖。"""
                            }
                        },
                        {
                            "id": "1001120202",
                            "name": "千位",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对开奖号的千位进行大（5~9）小（0~4），单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号的千位号码形态相同，即为中奖。",
                                "fl": """选号：小、双，开奖号：92218，千位号码2在小0~4的范围内，且为双数，故中奖。"""
                            }
                        },
                        {
                            "id": "1001120203",
                            "name": "百位",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对开奖号的百位进行大（5~9）小（0~4）、单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号的百位号码形态相同，即为中奖。",
                                "fl": """选号：小、双，开奖号：43075，百位号码0在小0~4的范围内，且为双数，故中奖。"""
                            }
                        },
                        {
                            "id": "1001120204",
                            "name": "十位",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对开奖号的十位进行大（5~9）小（0~4）、单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号的十位号码形态相同，即为中奖。",
                                "fl": """选号：小、单，开奖号：41112，十位号码1在小0~4的范围内，且为单数，故中奖。"""
                            }
                        },
                        {
                            "id": "1001120205",
                            "name": "个位",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对开奖号的个位进行大（5~9）小（0~4）、单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选形态与开奖号的个位号码形态相同，即为中奖。",
                                "fl": """选号：大、双，开奖号：86178，个位号码8在大5~9的范围内，且为双数，故中奖。"""
                            }
                        },
                    ],
                },
                {
                    "id": "10011203",
                    "name": "串关",
                    "value": [
                        {
                            "id": "1001120301",
                            "name": "串关",
                            "rate": "1.98",  # 赔率
                            "memo": {
                                "wfts": "对5个开奖号的大（5~9）小（0~4）、单双进行投注，任选1个形态为一注。",
                                "zjsm": "所选位置及形态与开奖号的位置及形态相同，即为中奖。",
                                "fl": """选号：万位-大、个位-双，开奖号：62238，开奖号万位6在大5~9的范围内，个位8为双数，故中奖。注：如当次所选的位置及形态有多个，则须与开奖号位置及形态全部相同，只中任意一个位置或形态均不算中奖。"""
                            }
                        },
                    ],
                },
            ]
        },
    ]
}
cptypes.append(cptype)